In [1]:
%load_ext sql
%reload_ext sql
%sql sqlite://

In [2]:
%%sql
CREATE TABLE Worker (
WORKER_ID INT,
FIRST_NAME CHAR(25),
LAST_NAME CHAR(25),
SALARY INT(15),
JOINING_DATE DATETIME,
DEPARTMENT CHAR(25)
);

 * sqlite://
Done.

[]

In [3]:
%%sql
INSERT INTO Worker VALUES(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR');
INSERT INTO Worker VALUES(2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin');
INSERT INTO Worker VALUES(3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR');
INSERT INTO Worker VALUES(4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin');
INSERT INTO Worker VALUES(5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin');
INSERT INTO Worker VALUES(6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account');
INSERT INTO Worker VALUES(7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account');
INSERT INTO Worker VALUES(8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

#### Q-1. Write an SQL query to print details of the Workers who have joined in Febâ€™2014.

In [4]:
%%sql
select * from worker where JOINING_DATE like '%14-02%'

 * sqlite://
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin')]

#### Q-2. Write an SQL query to fetch duplicate records having matching data in some fields of a table.

In [6]:
%%sql
CREATE TABLE Employee (
    ID INT PRIMARY KEY,
    FIRST_NAME VARCHAR(50),
    LAST_NAME VARCHAR(50),
    COUNTRY VARCHAR(50)
);

 * sqlite://
Done.

[]

In [7]:
%%sql
INSERT INTO Employee VALUES 
(1,'ADITYA','VARMA','INDIA'),
(2,'ADITYA','VARMA','INDIA'),
(3,'ADITYA','VARMA','INDIA'),
(4,'STEVE','JOBS','USA'),
(5,'STEVE','JOBS','USA'),
(6,'STEVE','JOBS','USA');

 * sqlite://
6 rows affected.

[]

In [8]:
%%sql
select first_name,last_name, country, COUNT(*) from employee GROUP BY first_name,last_name,country HAVING COUNT(*)>1;

 * sqlite://
Done.

[('ADITYA', 'VARMA', 'INDIA', 3), ('STEVE', 'JOBS', 'USA', 3)]

#### Q-3. How to remove duplicate rows from Employees table.

In [18]:
%%sql
DELETE FROM  Employee WHERE ID NOT IN (SELECT MAX(ID) FROM Employee GROUP BY FIRST_NAME,LAST_NAME,COUNTRY)

 * sqlite://
4 rows affected.

[]

In [19]:
%%sql
select * from Employee

 * sqlite://
Done.

[(3, 'ADITYA', 'VARMA', 'INDIA'), (6, 'STEVE', 'JOBS', 'USA')]